# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "xcodesorg/made"

# Core CLI Tools
brew "git"
brew "gh"
brew "curl"
brew "aria2"
brew "cloc"

# Development
brew "go"
brew "rbenv"
brew "volta"
brew "swiftlint"
brew "vapor"
brew "xcodesorg/made/xcodes"

# Docker
brew "docker"
cask "docker"

# Applications - Development
cask "visual-studio-code"
cask "cursor"
cask "iterm2"
cask "tower"
cask "proxyman"
cask "rapidapi"
cask "sf-symbols"

# Applications - AI
cask "claude"

# Applications - Design
cask "figma"

# Applications - Utilities
cask "google-chrome"
cask "portkiller"
cask "repobar"
cask "steam"

# Fonts
cask "font-caskaydia-cove-nerd-font"
