# Core CLI Tools
brew "git"
brew "gh"
brew "curl"
brew "aria2"
brew "cloc"

# Development
brew "go"
brew "rbenv"
brew "volta"
brew "swiftlint"
brew "vapor"
brew "xcodesorg/made/xcodes"

# Docker
brew "docker"
brew "docker-compose"
cask "docker-desktop"

# Applications - Development
cask "visual-studio-code"
cask "iterm2"
cask "tower"
cask "proxyman"
cask "rapidapi"
cask "sf-symbols"

# Applications - AI
cask "claude"

# Applications - Utilities
cask "productdevbook/tap/portkiller"
cask "steipete/tap/repobar"

# Fonts
cask "font-caskaydia-cove-nerd-font"
